app/Controllers/Client.php

SELECT *
FROM `operateurs`
---
    public function index()
    {
        if (session()->get('user_type') === 'client') {
            return redirect()->to(base_url('client/dashboard'));
        }

        // Récupérer MON opérateur pour afficher les préfixes acceptés
        $operateurs = $this->operateurModel->findAll();

SELECT *
FROM `operateurs`
---
    public function login()
    {
        $numero = trim($this->request->getPost('numero_telephone') ?? '');

        if (!$numero) {
            return redirect()->back()->with('error', 'Veuillez entrer votre numéro de téléphone.');
        }

        $numero = preg_replace('/\s+/', '', $numero);

        // Récupérer MON opérateur (le premier dans la liste)
        $operateurs = $this->operateurModel->findAll();

SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`id` = 6
---
    public function dashboard()
    {
        $userId      = session()->get('user_id');
        $utilisateur = $this->utilisateurModel->find($userId);

SELECT *
FROM `operateurs`
WHERE `operateurs`.`id` = 1
---
    public function transfert()
    {
        if ($this->request->is('get')) {
            return view('client/transfert');
        }

        $montantGlobal = (float)  $this->request->getPost('montant');
        $destinataireRaw = trim($this->request->getPost('telephone_destinataire') ?? '');
        $inclureFraisRetrait = (bool) $this->request->getPost('inclure_frais_retrait');
        $userId        = session()->get('user_id');
        $monTelephone  = session()->get('numero_telephone');
        $monOperateurId = session()->get('operateur_id');

        // Détection auto de mon opérateur
        $monOperateur = $this->operateurModel->find($monOperateurId);

SELECT *
FROM `operateurs`
WHERE `operateurs`.`id` = 1
---
            }
        }

        $operateur = $this->operateurModel->find($operateurId);

SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`id` = 10
---
            return redirect()->back()->with('error', 'Type transfert non configuré pour cet opérateur.');
        }

        $expediteur = $this->utilisateurModel->find($userId);