app/Controllers/Client.php

    public function dashboard()
    {
        $userId      = session()->get('user_id');
        $utilisateur = $this->utilisateurModel->find($userId);
---
SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`id` = 6

    public function depot()
    {
        $operateurs = $this->operateurModel->findAll();
---
SELECT *
FROM `operateurs`

    public function retrait()
    {
        $operateurs = $this->operateurModel->findAll();
---
SELECT *
FROM `operateurs`

    public function transfert()
    {
        $operateurs = $this->operateurModel->findAll();
---
SELECT *
FROM `operateurs`