app/Controllers/Operateur.php

    public function dashboard()
    {
        $operateurs = $this->operateurModel->findAll();
---
SELECT *
FROM `operateurs`

    public function editer(int $id)
    {
        $operateur = $this->operateurModel->find($id);
---
SELECT *
FROM `operateurs`
WHERE `operateurs`.`id` = 1

    public function types(int $operateurId)
    {
        $operateur = $this->operateurModel->find($operateurId);
---
SELECT *
FROM `operateurs`
WHERE `operateurs`.`id` = 1

    public function clients()
    {
        $operateurs          = $this->operateurModel->findAll();
---
SELECT *
FROM `operateurs`