app/Models/OperateurModel.php

SELECT *
FROM `operateurs`
---
    public function detecterParTelephone(string $numero): ?array
    {
        foreach ($this->findAll() as $op) {