app/Models/TransactionModel.php

SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`id` = 6
SELECT `t`.*, `type_op`.`nom_operation`, `op`.`nom_operateur`, `op`.`prefixe_operateur`
FROM `transactions` `t`
JOIN `types_operations` `type_op` ON `t`.`type_operation_id` = `type_op`.`id`
JOIN `operateurs` `op` ON `type_op`.`operateur_id` = `op`.`id`
WHERE   (
`t`.`utilisateur_id` = 6
OR `t`.`telephone_destinataire` = '0340000034'
 )
ORDER BY `t`.`date_creation` DESC
 LIMIT 5
---
    public function getTransactionsUtilisateur(int $utilisateurId, int $limit = 50, int $offset = 0): array
    {
        // Récupérer le numéro de téléphone de l'utilisateur
        $userModel = new \App\Models\UtilisateurModel();
        $user = $userModel->find($utilisateurId);
        $monNumero = $user['numero_telephone'] ?? '';

        // Récupérer transactions où je suis l'expéditeur OU le destinataire
        $builder = $this->db->table('transactions t')
            ->select('t.*, type_op.nom_operation, op.nom_operateur, op.prefixe_operateur')
            ->join('types_operations type_op', 't.type_operation_id = type_op.id')
            ->join('operateurs op', 'type_op.operateur_id = op.id')
            ->groupStart()
                ->where('t.utilisateur_id', $utilisateurId)
                ->orWhere('t.telephone_destinataire', $monNumero)
            ->groupEnd()
            ->orderBy('t.date_creation', 'DESC')
            ->limit($limit, $offset);

        return $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `utilisateur_id` = 6
---
    public function countTransactionsUtilisateur(int $utilisateurId): int
    {
        return (int) $this->db->table('transactions')
            ->where('utilisateur_id', $utilisateurId)
            ->countAllResults();

SELECT `t`.`montant`, `t`.`frais`, `t`.`telephone_destinataire`, `t`.`montant_a_envoyer`, `t`.`commission_externe`, `type_op`.`nom_operation`
FROM `transactions` `t`
JOIN `types_operations` `type_op` ON `t`.`type_operation_id` = `type_op`.`id`
WHERE `type_op`.`operateur_id` = 3
SELECT `t`.`montant`, `t`.`frais`, `t`.`telephone_destinataire`, `t`.`montant_a_envoyer`, `t`.`commission_externe`, `type_op`.`nom_operation`
FROM `transactions` `t`
JOIN `types_operations` `type_op` ON `t`.`type_operation_id` = `type_op`.`id`
WHERE `type_op`.`operateur_id` = 1
SELECT *
FROM `operateurs`
WHERE `operateurs`.`id` = 1
---
    public function getStatsOperateur(int $operateurId, ?string $dateDebut = null, ?string $dateFin = null): array
    {
        $builder = $this->db->table('transactions t')
            ->select('t.montant, t.frais, t.telephone_destinataire, t.montant_a_envoyer, t.commission_externe, type_op.nom_operation')
            ->join('types_operations type_op', 't.type_operation_id = type_op.id')
            ->where('type_op.operateur_id', $operateurId);

        if ($dateDebut) $builder->where('t.date_creation >=', $dateDebut . ' 00:00:00');
        if ($dateFin)   $builder->where('t.date_creation <=', $dateFin   . ' 23:59:59');

        $rows  = $builder->get()->getResultArray();

        $operateurModel = new \App\Models\OperateurModel();
        $courantOp = $operateurModel->find($operateurId);

SELECT SUM(t.commission_externe) as total
FROM `transactions` `t`
JOIN `types_operations` `type_op` ON `t`.`type_operation_id` = `type_op`.`id`
WHERE `t`.`telephone_destinataire` IS NOT NULL
AND `t`.`commission_externe` > 0
SELECT `t`.`commission_externe`, `t`.`telephone_destinataire`
FROM `transactions` `t`
WHERE `t`.`commission_externe` > 0
---
        $stats['gains_transfert'] = $stats['gains_transfert_meme_op'] + $stats['gains_transfert_autre_op'];

        // Calculer les commissions REÇUES (quand d'autres opérateurs envoient vers nous)
        $commissionsRecues = $this->db->table('transactions t')
            ->select('SUM(t.commission_externe) as total')
            ->join('types_operations type_op', 't.type_operation_id = type_op.id')
            ->where('t.telephone_destinataire IS NOT NULL')
            ->where('t.commission_externe >', 0)
            ->get()->getRowArray();

        // Vérifier si les destinataires sont de notre opérateur
        $rows2 = $this->db->table('transactions t')
            ->select('t.commission_externe, t.telephone_destinataire')
            ->where('t.commission_externe >', 0)
            ->get()->getResultArray();