app/Models/UtilisateurModel.php

SELECT *
FROM `utilisateurs`
WHERE `numero_telephone` = '0340001234'
 LIMIT 1
---
    public function getByTelephone(string $numero): ?array
    {
        return $this->where('numero_telephone', $numero)->first();

SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`id` = 5
---
    public function getSolde(int $id): float
    {
        $u = $this->find($id);

SELECT *
FROM `utilisateurs`
WHERE `numero_telephone` LIKE '034, 038%' ESCAPE '!'
ORDER BY `date_creation` DESC
---
    public function getUtilisateursByPrefixe(string $prefixe): array
    {
        return $this->like('numero_telephone', $prefixe, 'after')
                    ->orderBy('date_creation', 'DESC')
                    ->findAll();